Documents/ВстречиСКандидатами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>ВстречиСКандидатами</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Кандидат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацияКандидатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вакансия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Вакансии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтогСобеседования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ВстречиСКандидатами/Forms/ФормаВыбора/Ext/Form/Module.bsl
Процедура ЗаполнитьЭлементыПланировщика()
	
	ЭлементыПланировщика = Планировщик.Элементы;
    ЭлементыПланировщика.Очистить();
	
	              	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВстречиСКандидатами.Дата КАК Дата,
		|	ВстречиСКандидатами.Кандидат,
		|	ВстречиСКандидатами.Вакансия
		|ИЗ
		|	Документ.ВстречиСКандидатами КАК ВстречиСКандидатами
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для каждого подстрока Из РезультатЗапроса Цикл
		
		НовыйЭлемент = ЭлементыПланировщика.Добавить(подстрока.Дата, подстрока.Дата);
		
		НовыйЭлемент.Текст = подстрока.Ссылка;
		НовыйЭлемент.ЦветФона = WebЦвета.ЗеленаяЛужайка;	
		НовыйЭлемент.Картинка = БиблиотекаКартинок.Ресурс;
		НовыйЭлемент.Значение = подстрока.Ссылка;
		
		КонецЦикла;
	
КонецПроцедуры
